bdlondon-2023/throughput/output/step-10-SH.txt
163420 records sent, 32573,3 records/sec (7,92 MB/sec), 2513,1 ms avg latency, 3846,0 ms max latency.
419253 records sent, 83766,8 records/sec (20,37 MB/sec), 1657,6 ms avg latency, 2847,0 ms max latency.
488183 records sent, 97617,1 records/sec (23,74 MB/sec), 1303,2 ms avg latency, 1936,0 ms max latency.
576023 records sent, 115204,6 records/sec (28,02 MB/sec), 1088,5 ms avg latency, 1414,0 ms max latency.
473299 records sent, 94527,5 records/sec (22,99 MB/sec), 1283,5 ms avg latency, 1929,0 ms max latency.
2500000 records sent, 90155,066715 records/sec (21,92 MB/sec), 1333,09 ms avg latency, 3846,00 ms max latency, 1234 ms 50th, 2362 ms 95th, 3563 ms 99th, 3796 ms 99.9th.